КаталогКомпоненты = ОбъединитьПути(ТекущийСценарий().Каталог, "raylibos/bin/Debug/net6.0/raylibos.dll");
ПодключитьВнешнююКомпоненту(КаталогКомпоненты);
Рейлиб = Новый Рейлиб;

Рейлиб.ИнициализацияОкна("Raylibos DrawTriangleStrip Test", 800, 600);

Белый = Рейлиб.НовыйЦвет(255, 255, 255, 255);
Красный = Рейлиб.НовыйЦвет(200, 0, 0, 255);
Синий = Рейлиб.НовыйЦвет(0, 0, 200, 255);
Зеленый = Рейлиб.НовыйЦвет(0, 200, 0, 255);
Черный = Рейлиб.НовыйЦвет(0, 0, 0, 255);


Смещение = 200;

ТочкиПолоса = Новый Массив;
ТочкиПолоса.Добавить(Рейлиб.НовыйВектор(100, 200)); // 0
ТочкиПолоса.Добавить(Рейлиб.НовыйВектор(102, 250)); // 1
ТочкиПолоса.Добавить(Рейлиб.НовыйВектор(150, 205)); // 2
ТочкиПолоса.Добавить(Рейлиб.НовыйВектор(145, 245)); // 3

ТочкиПолоса2 = Новый Массив;
ТочкиПолоса2.Добавить(Рейлиб.НовыйВектор(Смещение + 100, 200)); // 0
ТочкиПолоса2.Добавить(Рейлиб.НовыйВектор(Смещение + 102, 250)); // 1
ТочкиПолоса2.Добавить(Рейлиб.НовыйВектор(Смещение + 145, 245)); // 3
ТочкиПолоса2.Добавить(Рейлиб.НовыйВектор(Смещение + 150, 205)); // 2


Рейлиб.УстановитьЧастотуКадров(60);

Пока Не Рейлиб.ОкноДолжноЗакрыться() Цикл

	Рейлиб.НачатьОтрисовку();

	Рейлиб.ОчиститьФон(Белый);

	// Отрисовка треугольных полос
	Рейлиб.НарисоватьТреугольникПолоса(ТочкиПолоса, Зеленый);
	Рейлиб.НарисоватьТреугольникВеер(ТочкиПолоса2, Синий);


	Рейлиб.ПоказатьFPS();

	Рейлиб.ЗакончитьОтрисовку();

КонецЦикла;

Рейлиб.ЗакрытьОкно();
