КаталогКомпоненты = ОбъединитьПути(ТекущийСценарий().Каталог, "raylibos/bin/Debug/net6.0/raylibos.dll");
ПодключитьВнешнююКомпоненту(КаталогКомпоненты);
Рейлиб = Новый Рейлиб;

Рейлиб.ИнициализацияОкна("Color Utils", 480, 320);
Рейлиб.УстановитьЧастотуКадров(60);
Белый = Рейлиб.НовыйЦвет(255, 255, 255, 255);
Серый = Рейлиб.НовыйЦвет(190, 190, 190, 255);
Красный = Рейлиб.НовыйЦвет(220, 40, 40, 255);
Синий = Рейлиб.НовыйЦвет(40, 90, 220, 255);
Начало = Рейлиб.ВремяРаботы();

Пока Не Рейлиб.ОкноДолжноЗакрыться() И Рейлиб.ВремяРаботы() - Начало < 3 Цикл
    Прозрачность = (Рейлиб.ВремяРаботы() - Начало) / 3;
    ПолупрозрачныйКрасный = Рейлиб.ЦветСПрозрачностью(Красный, Прозрачность);
    ПолупрозрачныйСиний = Рейлиб.АльфаЦвета(Синий, Прозрачность);

    Рейлиб.НачатьОтрисовку();
    Рейлиб.ОчиститьФон(Белый);
    Рейлиб.НарисоватьПрямоугольник(40, 40, 180, 230, Серый);
    Рейлиб.НарисоватьПрямоугольник(260, 40, 180, 230, Серый);
    Рейлиб.НарисоватьПрямоугольник(70, 70, 120, 170, ПолупрозрачныйКрасный);
    Рейлиб.НарисоватьПрямоугольник(290, 70, 120, 170, ПолупрозрачныйСиний);
    Рейлиб.ЗакончитьОтрисовку();
КонецЦикла;
Рейлиб.ЗакрытьОкно();
