ПодключитьВнешнююКомпоненту("raylibos/bin/Debug/net6.0/raylibos.dll");
Рейлиб = Новый Рейлиб;


Рейлиб.ИнициализацияОкна("Заголовок", 800, 600);

Белый = Рейлиб.НовыйЦвет(255,255,255,255);

Черный = Рейлиб.НовыйЦвет(0,0,0,255);

Синий = Рейлиб.НовыйЦвет(0,0,200,255);

Красный = Рейлиб.НовыйЦвет(200,0,0,255);

Зеленый = Новый ЦветРЛ(0, 0, 200, 200);

Пока Не Рейлиб.ОкноДолжноЗакрыться() Цикл

	Рейлиб.НачатьОтрисовку();
	Рейлиб.ОчиститьФон(Белый);
	Рейлиб.НарисоватьТекст(Строка(ТекущаяДата()), 50, 50, 50, Зеленый);
	Рейлиб.НарисоватьКруг(100, 150, 35, Синий);
	Рейлиб.НарисоватьКругГрадиент(100, 220, 30.5, Синий, Красный);
	Рейлиб.НарисоватьКругЛиния(100, 280, 20, Синий);
	Рейлиб.НарисоватьЭллипс(100, 335, 20, 30, Красный);
	Рейлиб.НарисоватьЭллипсЛиния(100, 390, 30, 20, Синий);
	Рейлиб.НарисоватьПрямоугольник(200, 150, 50, 70, Красный);
	Рейлиб.НарисоватьПрямоугольникЛиния(200, 225, 70, 10, Синий);
	Рейлиб.НарисоватьПрямоугольникГрадиентВертикальный(200, 285, 50, 70, Красный, Синий);
	Рейлиб.НарисоватьПрямоугольникГрадиентГоризонтальный(200, 370, 70, 50, Синий, Красный);

	// Треугольники
	Вектор1 = Рейлиб.НовыйВектор(300, 150);
	Вектор2 = Рейлиб.НовыйВектор(350, 155);
	Вектор3 = Рейлиб.НовыйВектор(325, 180);
	Рейлиб.НарисоватьТреугольник(Вектор1, Вектор2, Вектор3, Красный);

	Вектор4 = Рейлиб.НовыйВектор(300, 185);
	Вектор5 = Рейлиб.НовыйВектор(350, 180);
	Вектор6 = Рейлиб.НовыйВектор(325, 210);
	Рейлиб.НарисоватьТреугольникЛиния(Вектор4, Вектор5, Вектор6, Синий);

	//
	Рейлиб.НарисоватьЛинию(300, 220, 350, 225, Синий);

	Приостановить(500);
	Рейлиб.ЗакончитьОтрисовку();

КонецЦикла;

Рейлиб.ЗакрытьОкно();
