КаталогКомпоненты = ОбъединитьПути(ТекущийСценарий().Каталог, "raylibos/bin/Debug/net6.0/raylibos.dll");
ПодключитьВнешнююКомпоненту(КаталогКомпоненты);
Рейлиб = Новый Рейлиб;


Рейлиб.ИнициализацияОкна("Raylibos Test", 800, 600);

// Загрузка текстуры
Текстура = Неопределено;

Текстура = Рейлиб.ЗагрузитьТекстуру("resources/raylib_logo.png");


Белый = Рейлиб.НовыйЦвет(255,255,255,255);

Пока Не Рейлиб.ОкноДолжноЗакрыться() Цикл

	Рейлиб.НачатьОтрисовку();

	Рейлиб.ОчиститьФон(Белый);

	Ширина = Рейлиб.ТекстураШирина(Текстура);
	Высота = Рейлиб.ТекстураВысота(Текстура);
	ПозX = 400 - Ширина / 2;
	ПозY = 300 - Высота / 2;
	Рейлиб.НарисоватьТекстуру(Текстура, ПозX, ПозY, Белый);

	Приостановить(500);
	Рейлиб.ЗакончитьОтрисовку();

КонецЦикла;

// Выгрузка текстуры
Если Текстура <> Неопределено Тогда
    Рейлиб.ВыгрузитьТекстуру(Текстура);
КонецЕсли;

Рейлиб.ЗакрытьОкно();
