Перем Рейлиб Экспорт;
Перем Кубики Экспорт; // Массив из см. НовыйОписаниеКубика
Перем ЦветКубика Экспорт;
Перем СкоростьПадения Экспорт;
Перем Высота Экспорт;
Перем Ширина Экспорт;

// КонструкторКубика
// Параметры:
//	Х - Число - позиция Х
//	У - Число - Позиция У
//	Ширина - Число - 
//	Высота - Число -
// 	Угол - Число -
//  Статичный - Булево -
// Возвращаемое значение:
// Структура:
// * Х - Число -
// * У - Число -
// * Ширина - Число - 
// * Высота - Число -
// * Угол - Число -
// * Статичный - Булево -
// * Центр - Произвольный -
// * Масса - Число -
// * ПоловинаШирина - Число - 
// * ПоловинаВысота - Число -
Функция НовыйОписаниеКубика(Х, У, Ширина = 30, Высота = 30, Угол = 0, Статичный = Ложь)
	Описание = Новый Структура("Х, У, Угол, Статичный, Ширина, Высота", Х, У, Угол, Статичный, Ширина, Высота);

	Описание.Вставить("Центр", Рейлиб.НовыйВектор(Ширина / 2, Высота / 2));
	Описание.Вставить("Масса", 30);
	Описание.Вставить("ПоловинаШирина", Ширина / 2);
	Описание.Вставить("ПоловинаВысота", Высота / 2);

	Возврат Описание;
КонецФункции


// <Описание процедуры>
//
Процедура ДобавитьКубик(Х, У, Ширина = 30, Высота = 30, Статичный = Ложь)
	Кубики.Добавить(НовыйОписаниеКубика(Х, У, Ширина, Высота, 0, Статичный));
КонецПроцедуры

Процедура НарисоватьКубики()
	Для Каждого Кубик Из Кубики Цикл
		Прямоугольник = Рейлиб.НовыйПрямоугольник(Кубик.Х, Кубик.У, Кубик.Ширина, Кубик.Высота);
		Рейлиб.НарисоватьПрямоугольникПро(Прямоугольник, Кубик.Центр, Кубик.Угол, ЦветКубика);
	КонецЦикла;
КонецПроцедуры

// Расчет позиции кубика
// Параметры:
//	Кубик - см. НовыйОписаниеКубика
Процедура РасчитатьКубики()

КонецПроцедуры

КаталогКомпоненты = ОбъединитьПути(ТекущийСценарий().Каталог, "raylibos/bin/Debug/net6.0/raylibos.dll");
ПодключитьВнешнююКомпоненту(КаталогКомпоненты);
Рейлиб = Новый Рейлиб;

Ширина = 800;
Высота = 600;

СкоростьПадения = 5;

Кубики = Новый Массив; // Массив из см. НовыйОписаниеКубика

Рейлиб.ИнициализацияОкна("Raylibos phiz", Ширина, Высота);

Белый = Рейлиб.НовыйЦвет(255, 255, 255, 255);

ЦветКубика = Рейлиб.НовыйЦвет(0, 0, 200, 255);

ДобавитьКубик(145, 100, 70, 10);

ДобавитьКубик(150, 150);
ДобавитьКубик(185, 201);

ДобавитьКубик(400 ,Высота - 25, 750, 10, Истина);

Рейлиб.УстановитьЧастотуКадров(30);

Пока НЕ Рейлиб.ОкноДолжноЗакрыться() Цикл

	Рейлиб.НачатьОтрисовку();
	Рейлиб.ОчиститьФон(Белый);
	
	РасчитатьКубики();
	НарисоватьКубики();

	Рейлиб.ПоказатьFPS(20, 15);

	Рейлиб.ЗакончитьОтрисовку();
	
КонецЦикла;

Рейлиб.ЗакрытьОкно();