КаталогКомпоненты = ОбъединитьПути(ТекущийСценарий().Каталог, "raylibos/bin/Debug/net6.0/raylibos.dll");
ПодключитьВнешнююКомпоненту(КаталогКомпоненты);
Рейлиб = Новый Рейлиб;

Рейлиб.ИнициализацияОкна("3D Primitives", 480, 320);
Рейлиб.УстановитьЧастотуКадров(60);
Камера = Рейлиб.НоваяКамера3D(Рейлиб.НовыйВектор3(5, 4, 5), Рейлиб.НовыйВектор3(0, 0, 0), Рейлиб.НовыйВектор3(0, 1, 0), 45, 0);
Белый = Рейлиб.НовыйЦвет(255, 255, 255, 255);
Красный = Рейлиб.НовыйЦвет(200, 30, 30, 255);
Синий = Рейлиб.НовыйЦвет(20, 80, 210, 255);
НачалоЛинии = Рейлиб.НовыйВектор3(-2, 0, 0);
КонецЛинии = Рейлиб.НовыйВектор3(2, 0, 0);
ЦентрСферы = Рейлиб.НовыйВектор3(0, 0.7, 0);
Начало = Рейлиб.ВремяРаботы();

Пока Не Рейлиб.ОкноДолжноЗакрыться() И Рейлиб.ВремяРаботы() - Начало < 2 Цикл
    Рейлиб.НачатьОтрисовку();
    Рейлиб.ОчиститьФон(Белый);
    Рейлиб.НачатьРежим3D(Камера);
    Рейлиб.НарисоватьЛинию3D(НачалоЛинии, КонецЛинии, Синий);
    Рейлиб.НарисоватьСферу(ЦентрСферы, 0.7, Красный);
    Рейлиб.ЗакончитьРежим3D();
    Рейлиб.ЗакончитьОтрисовку();
КонецЦикла;
Рейлиб.ЗакрытьОкно();
