КаталогКомпоненты = ОбъединитьПути(ТекущийСценарий().Каталог, "raylibos/bin/Debug/net6.0/raylibos.dll");
ПодключитьВнешнююКомпоненту(КаталогКомпоненты);
Рейлиб = Новый Рейлиб;

Рейлиб.ИнициализацияОкна("Raylibos Texture Generation", 800, 450);

Белый = Рейлиб.НовыйЦвет(255,255,255,255);
Красный = Рейлиб.НовыйЦвет(200,0,0,255);
Синий = Рейлиб.НовыйЦвет(0,0,200,255);
Черный = Рейлиб.НовыйЦвет(0,0,0,255);
СветлоСерый = Рейлиб.НовыйЦвет(200,200,200,255);
НебесноГолубой = Рейлиб.НовыйЦвет(135,206,235,255);

// Генерация изображений
ВертикальныйГрадиент = Рейлиб.ГенерироватьГрадиентЛинейный(800, 450, 0, Красный, Синий);
ГоризонтальныйГрадиент = Рейлиб.ГенерироватьГрадиентЛинейный(800, 450, 90, Красный, Синий);
ДиагональныйГрадиент = Рейлиб.ГенерироватьГрадиентЛинейный(800, 450, 45, Красный, Синий);
РадиальныйГрадиент = Рейлиб.ГенерироватьГрадиентРадиальный(800, 450, 0.0, Белый, Черный);
КвадратныйГрадиент = Рейлиб.ГенерироватьГрадиентКвадратный(800, 450, 0, Белый, Черный);
Шахматный = Рейлиб.ГенерироватьШахматный(800, 450, 32, 32, Красный, Синий);
БелыйШум = Рейлиб.ГенерироватьБелыйШум(800, 450, 0.5);
ШумПерлина = Рейлиб.ГенерироватьШумПерлина(800, 450, 50, 50, 4.0);
Клеточный = Рейлиб.ГенерироватьКлеточный(800, 450, 32);

// Загрузка текстур из изображений
Текстуры = Новый Массив;
Текстуры.Добавить(Рейлиб.ЗагрузитьТекстуруИзИзображения(ВертикальныйГрадиент));
Текстуры.Добавить(Рейлиб.ЗагрузитьТекстуруИзИзображения(ГоризонтальныйГрадиент));
Текстуры.Добавить(Рейлиб.ЗагрузитьТекстуруИзИзображения(ДиагональныйГрадиент));
Текстуры.Добавить(Рейлиб.ЗагрузитьТекстуруИзИзображения(РадиальныйГрадиент));
Текстуры.Добавить(Рейлиб.ЗагрузитьТекстуруИзИзображения(КвадратныйГрадиент));
Текстуры.Добавить(Рейлиб.ЗагрузитьТекстуруИзИзображения(Шахматный));
Текстуры.Добавить(Рейлиб.ЗагрузитьТекстуруИзИзображения(БелыйШум));
Текстуры.Добавить(Рейлиб.ЗагрузитьТекстуруИзИзображения(ШумПерлина));
Текстуры.Добавить(Рейлиб.ЗагрузитьТекстуруИзИзображения(Клеточный));

// Выгрузка изображений (CPU RAM)
Рейлиб.ВыгрузитьИзображение(ВертикальныйГрадиент);
Рейлиб.ВыгрузитьИзображение(ГоризонтальныйГрадиент);
Рейлиб.ВыгрузитьИзображение(ДиагональныйГрадиент);
Рейлиб.ВыгрузитьИзображение(РадиальныйГрадиент);
Рейлиб.ВыгрузитьИзображение(КвадратныйГрадиент);
Рейлиб.ВыгрузитьИзображение(Шахматный);
Рейлиб.ВыгрузитьИзображение(БелыйШум);
Рейлиб.ВыгрузитьИзображение(ШумПерлина);
Рейлиб.ВыгрузитьИзображение(Клеточный);

ТекущаяТекстура = 0;
Имена = Новый Массив;
Имена.Добавить("VERTICAL GRADIENT");
Имена.Добавить("HORIZONTAL GRADIENT");
Имена.Добавить("DIAGONAL GRADIENT");
Имена.Добавить("RADIAL GRADIENT");
Имена.Добавить("SQUARE GRADIENT");
Имена.Добавить("CHECKED");
Имена.Добавить("WHITE NOISE");
Имена.Добавить("PERLIN NOISE");
Имена.Добавить("CELLULAR");

Рейлиб.УстановитьЧастотуКадров(60);

Пока Не Рейлиб.ОкноДолжноЗакрыться() Цикл

	Рейлиб.НачатьОтрисовку();

	Рейлиб.ОчиститьФон(Белый);

	// Отрисовка текущей текстуры
	Рейлиб.НарисоватьТекстуру(Текстуры[ТекущаяТекстура], 0, 0, Белый);

	// Подсказка
	Рейлиб.НарисоватьПрямоугольник(30, 400, 325, 30, НебесноГолубой);
	Рейлиб.НарисоватьПрямоугольникЛиния(30, 400, 325, 30, Белый);
	Рейлиб.НарисоватьТекст("MOUSE LEFT BUTTON to CYCLE PROCEDURAL TEXTURES", 40, 410, 10, Белый);

	// Название текущей текстуры
	Рейлиб.НарисоватьТекст(Имена[ТекущаяТекстура], 540, 10, 20, СветлоСерый);

	Рейлиб.ЗакончитьОтрисовку();

	// Переключение по клику
	Если Рейлиб.КнопкаМышиНажата(0) Тогда
		ТекущаяТекстура = (ТекущаяТекстура + 1) % Текстуры.Количество();
	КонецЕсли;

КонецЦикла;

// Выгрузка текстур (GPU VRAM)
Для Каждого Текстура Из Текстуры Цикл
    Рейлиб.ВыгрузитьТекстуру(Текстура);
КонецЦикла;

Рейлиб.ЗакрытьОкно();
