КаталогКомпоненты = ОбъединитьПути(ТекущийСценарий().Каталог, "raylibos/bin/Debug/net6.0/raylibos.dll");
ПодключитьВнешнююКомпоненту(КаталогКомпоненты);
Рейлиб = Новый Рейлиб;


Рейлиб.ИнициализацияОкна("raylib [core] example - input mouse", 800, 450);

Белый = Рейлиб.НовыйЦвет(245, 245, 245, 255);
Черный = Рейлиб.НовыйЦвет(0, 0, 0, 255);
Серый = Рейлиб.НовыйЦвет(130, 130, 130, 255);
Красный = Рейлиб.НовыйЦвет(230, 41, 55, 255);
Зеленый = Рейлиб.НовыйЦвет(0, 228, 48, 255);
Синий = Рейлиб.НовыйЦвет(0, 121, 241, 255);
Бордовый = Рейлиб.НовыйЦвет(190, 33, 55, 255);
Фиолетовый = Рейлиб.НовыйЦвет(200, 122, 255, 255);
Желтый = Рейлиб.НовыйЦвет(253, 249, 0, 255);
Оранжевый = Рейлиб.НовыйЦвет(255, 161, 0, 255);
Бежевый = Рейлиб.НовыйЦвет(211, 176, 131, 255);

ЦветШара = Синий;

Пока Не Рейлиб.ОкноДолжноЗакрыться() Цикл

    Если Рейлиб.КлавишаНажата(72) Тогда // KEY_H
        Если Рейлиб.КурсорСкрыт() Тогда
            Рейлиб.ПоказатьКурсор();
        Иначе
            Рейлиб.СкрытьКурсор();
        КонецЕсли;
    КонецЕсли;

    Позиция = Рейлиб.ПозицияМыши();
    X = Рейлиб.ВекторX(Позиция);
    Y = Рейлиб.ВекторY(Позиция);

    Если Рейлиб.КнопкаМышиНажата(0) Тогда // MOUSE_BUTTON_LEFT
        ЦветШара = Бордовый;
    ИначеЕсли Рейлиб.КнопкаМышиНажата(2) Тогда // MOUSE_BUTTON_MIDDLE
        ЦветШара = Зеленый;
    ИначеЕсли Рейлиб.КнопкаМышиНажата(1) Тогда // MOUSE_BUTTON_RIGHT
        ЦветШара = Синий;
    ИначеЕсли Рейлиб.КнопкаМышиНажата(3) Тогда // MOUSE_BUTTON_SIDE
        ЦветШара = Фиолетовый;
    ИначеЕсли Рейлиб.КнопкаМышиНажата(4) Тогда // MOUSE_BUTTON_EXTRA
        ЦветШара = Желтый;
    ИначеЕсли Рейлиб.КнопкаМышиНажата(5) Тогда // MOUSE_BUTTON_FORWARD
        ЦветШара = Оранжевый;
    ИначеЕсли Рейлиб.КнопкаМышиНажата(6) Тогда // MOUSE_BUTTON_BACK
        ЦветШара = Бежевый;
    КонецЕсли;

    Рейлиб.НачатьОтрисовку();
    Рейлиб.ОчиститьФон(Белый);
    
    Рейлиб.НарисоватьТекст("Move ball with mouse and press buttons to change color", 10, 10, 20, Серый);
    Рейлиб.НарисоватьТекст("Press 'H' to hide/show cursor", 10, 30, 20, Серый);
    
    Если Рейлиб.КурсорСкрыт() Тогда
        Рейлиб.НарисоватьТекст("CURSOR HIDDEN", 20, 60, 20, Красный);
    Иначе
        Рейлиб.НарисоватьТекст("CURSOR VISIBLE", 20, 60, 20, Зеленый);
    КонецЕсли;
    
    Рейлиб.НарисоватьКруг(X, Y, 40, ЦветШара);
    
    Рейлиб.ЗакончитьОтрисовку();

КонецЦикла;

Рейлиб.ЗакрытьОкно();
