КаталогКомпоненты = ОбъединитьПути(ТекущийСценарий().Каталог, "raylibos/bin/Debug/net6.0/raylibos.dll");
ПодключитьВнешнююКомпоненту(КаталогКомпоненты);
Рейлиб = Новый Рейлиб;

Рейлиб.ИнициализацияОкна("Screen coordinates Test", 480, 320);
Камера2D = Рейлиб.НоваяКамера2D(Рейлиб.НовыйВектор(0, 0), Рейлиб.НовыйВектор(240, 160), 0, 1);
Экран = Рейлиб.МирНаЭкран2D(Рейлиб.НовыйВектор(0, 0), Камера2D);
Мир = Рейлиб.ЭкранВМир2D(Экран, Камера2D);
Если Рейлиб.ВекторX(Экран) < 239.99 Или Рейлиб.ВекторX(Экран) > 240.01
    Или Рейлиб.ВекторY(Экран) < 159.99 Или Рейлиб.ВекторY(Экран) > 160.01
    Или Рейлиб.ВекторX(Мир) < -0.01 Или Рейлиб.ВекторX(Мир) > 0.01
    Или Рейлиб.ВекторY(Мир) < -0.01 Или Рейлиб.ВекторY(Мир) > 0.01 Тогда
    ВызватьИсключение "Преобразование 2D координат неверно";
КонецЕсли;
Матрица2D = Рейлиб.МатрицаКамеры2D(Камера2D);

Камера3D = Рейлиб.НоваяКамера3D(Рейлиб.НовыйВектор3(0, 0, 5), Рейлиб.НовыйВектор3(0, 0, 0), Рейлиб.НовыйВектор3(0, 1, 0), 45, 0);
Экран3D = Рейлиб.МирНаЭкран3D(Рейлиб.НовыйВектор3(0, 0, 0), Камера3D);
Экран3DEx = Рейлиб.МирНаЭкран3DEx(Рейлиб.НовыйВектор3(0, 0, 0), Камера3D, 480, 320);
Луч = Рейлиб.ЛучИзЭкрана(Экран3D, Камера3D);
ПозицияЛуча = Рейлиб.ЛучПозиция(Луч);
НаправлениеЛуча = Рейлиб.ЛучНаправление(Луч);
Матрица3D = Рейлиб.МатрицаКамеры3D(Камера3D);
Если Рейлиб.ВекторX(Экран3D) < 239 Или Рейлиб.ВекторX(Экран3D) > 241 Тогда
    ВызватьИсключение "Проекция 3D неверна";
КонецЕсли;

Рейлиб.ЗакрытьОкно();
