КаталогКомпоненты = ОбъединитьПути(ТекущийСценарий().Каталог, "raylibos/bin/Debug/net6.0/raylibos.dll");
ПодключитьВнешнююКомпоненту(КаталогКомпоненты);
Рейлиб = Новый Рейлиб;


Рейлиб.ИнициализацияОкна("Circle Movement", 800, 600);

Белый = Рейлиб.НовыйЦвет(255,255,255,255);
Черный = Рейлиб.НовыйЦвет(0,0,0,255);
Синий = Рейлиб.НовыйЦвет(0,0,200,255);

X = 400;
Y = 300;
Скорость = 0.05;

Пока Не Рейлиб.ОкноДолжноЗакрыться() Цикл

    Если Рейлиб.КлавишаНажата(262) Тогда // KEY_RIGHT
        X = X + Скорость;
    КонецЕсли;
    
    Если Рейлиб.КлавишаНажата(263) Тогда // KEY_LEFT
        X = X - Скорость;
    КонецЕсли;
    
    Если Рейлиб.КлавишаНажата(264) Тогда // KEY_DOWN
        Y = Y + Скорость;
    КонецЕсли;
    
    Если Рейлиб.КлавишаНажата(265) Тогда // KEY_UP
        Y = Y - Скорость;
    КонецЕсли;

    Рейлиб.НачатьОтрисовку();
    Рейлиб.ОчиститьФон(Белый);
    Рейлиб.НарисоватьКруг(X, Y, 35, Синий);
    Рейлиб.НарисоватьТекст("Use arrow keys to move", 200, 50, 20, Черный);
    Рейлиб.НарисоватьТекст("Position: " + X + ", " + Y, 200, 80, 20, Черный);
    Рейлиб.ЗакончитьОтрисовку();

КонецЦикла;

Рейлиб.ЗакрытьОкно();
