ПодключитьВнешнююКомпоненту("raylibos/bin/Debug/net6.0/raylibos.dll");
Рейлиб = Новый Рейлиб;


Рейлиб.ИнициализацияОкна("Заголовок", 800, 600);

Белый = Рейлиб.НовыйЦвет(255,255,255,255);

Черный = Рейлиб.НовыйЦвет(0,0,0,255);

Синий = Рейлиб.НовыйЦвет(0,0,200,255);

Красный = Рейлиб.НовыйЦвет(200,0,0,255);

Пока Не Рейлиб.ОкноДолжноЗакрыться() Цикл

	Рейлиб.НачатьОтрисовку();
	Рейлиб.ОчиститьФон(Белый);
	Рейлиб.НарисоватьТекст(Строка(ТекущаяДата()), 50, 50, 50, Черный);
	Рейлиб.НарисоватьКруг(100, 150, 35, Синий);
	Рейлиб.НарисоватьКругГрадиент(100, 220, 30.5, Синий, Красный);
	Рейлиб.НарисоватьКругЛиния(100, 280, 20, Синий);
	Рейлиб.НарисоватьЭллипс(100, 335, 20, 30, Красный);
	Рейлиб.НарисоватьЭллипсЛиния(100, 390, 30, 20, Синий);
	Приостановить(500);
	Рейлиб.ЗакончитьОтрисовку();

КонецЦикла;

Рейлиб.ЗакрытьОкно();
