КаталогКомпоненты = ОбъединитьПути(ТекущийСценарий().Каталог, "raylibos/bin/Debug/net6.0/raylibos.dll");
ПодключитьВнешнююКомпоненту(КаталогКомпоненты);
Рейлиб = Новый Рейлиб;


Рейлиб.ИнициализацияОкна("Raylibos TexturePro Test", 800, 450);

Текстура = Рейлиб.ЗагрузитьТекстуру("resources/scarfy.png");

Белый = Рейлиб.НовыйЦвет(255,255,255,255);
Серый = Рейлиб.НовыйЦвет(128,128,128,255);

ШиринаКадра = Рейлиб.ТекстураШирина(Текстура) / 6;
ВысотаКадра = Рейлиб.ТекстураВысота(Текстура);

// Источник - часть текстуры для отрисовки
ИсхПрямоугольник = Рейлиб.НовыйПрямоугольник(0, 0, ШиринаКадра, ВысотаКадра);

// Назначение - прямоугольник на экране
НазПрямоугольник = Рейлиб.НовыйПрямоугольник(400, 225, ШиринаКадра * 2, ВысотаКадра * 2);

// Точка вращения/масштабирования (относительно назначения)
Начало = Рейлиб.НовыйВектор(ШиринаКадра, ВысотаКадра);

Вращение = 0;

Рейлиб.УстановитьЧастотуКадров(60);

Пока Не Рейлиб.ОкноДолжноЗакрыться() Цикл

	Рейлиб.НачатьОтрисовку();

	Рейлиб.ОчиститьФон(Белый);

	Вращение = Вращение + 1;

	// DrawTexturePro позволяет вращать и масштабировать часть текстуры
	Рейлиб.НарисоватьТекстуруПро(Текстура, ИсхПрямоугольник, НазПрямоугольник, Начало, Вращение, Белый);

	// Линии для наглядности
	Рейлиб.НарисоватьЛинию(400, 0, 400, 450, Серый);
	Рейлиб.НарисоватьЛинию(0, 225, 800, 225, Серый);

	Рейлиб.НарисоватьТекст("(c) Scarfy sprite by Eiden Marsal", 580, 430, 10, Серый);

	Рейлиб.ЗакончитьОтрисовку();

КонецЦикла;

// Выгрузка текстуры
Если Текстура <> Неопределено Тогда
    Рейлиб.ВыгрузитьТекстуру(Текстура);
КонецЕсли;

Рейлиб.ЗакрытьОкно();
