
Перем Минимум Экспорт; // Вектор
Перем Максимум Экспорт; // Вектор

// Конструктор
//
// Параметры:
//   Мин - Вектор -
//   Макс - Вектор -
//
Процедура ПриСозданииОбъекта(Мин, Макс)
	Минимум = Мин;
	Максимум = Макс;
КонецПроцедуры

// overlaps
//
// Параметры:
//   ААББ - ААББ -
//
//  Возвращаемое значение:
//   Булево
//
Функция Пересекается(ААББ) Экспорт
	Возврат Минимум.Х <= ААББ.Максимум.Х
		И Максимум.Х >= ААББ.Минимум.Х
		И Минимум.У <= ААББ.Максимум.У
		И Максимум.У >= ААББ.Минимум.У;
КонецФункции

// expand
//
// Параметры:
//   Точки - Массив из Вектор - 
//
Процедура Расширить(Точки) Экспорт
	Для Каждого Точка Из Точки Цикл
		Минимум = Минимум.Минимум(Точка);
		Максимум = Максимум.Максимум(Точка);
	КонецЦикла;
КонецПроцедуры
