
Перем Х Экспорт;
Перем У Экспорт;

Процедура ПриСозданииОбъекта(КоордХ, КоордУ)
	Х = КоордХ;
	У = КоордУ;
КонецПроцедуры

// Сложить с вектором
//
// Параметры:
//   Вектор - Вектор - 
//
//  Возвращаемое значение:
//   Вектор - 
//
Функция Сложить(Вектор) Экспорт
	Возврат Новый Вектор(Х + Вектор.Х, У + Вектор.У);
КонецФункции

// Вычесть вектор
//
// Параметры:
//   Вектор - Вектор - 
//
//  Возвращаемое значение:
//   Вектор - 
//
Функция Вычесть(Вектор) Экспорт
	Возврат Новый Вектор(Х - Вектор.Х, У - Вектор.У);
КонецФункции

// Умножить на число
//
// Параметры:
//   Размер - Число - 
//
//  Возвращаемое значение:
//   Вектор - 
//
Функция Умножить(Размер) Экспорт
	Возврат Новый Вектор(Х * Размер, У * Размер);
КонецФункции