
Перем Х Экспорт;
Перем У Экспорт;

Процедура ПриСозданииОбъекта(КоордХ, КоордУ)
	Х = КоордХ;
	У = КоордУ;
КонецПроцедуры

// Abs
//
// Параметры:
//   Число - Число - 
//
//  Возвращаемое значение:
//   Число - 
//
Функция МодульЧисла(Число)
	Возврат Макс(Число, -Число);
КонецФункции

// add
//
// Параметры:
//   Вектор - Вектор - 
//
//  Возвращаемое значение:
//   Вектор - 
//
Функция Сложить(Вектор) Экспорт
	Возврат Новый Вектор(Х + Вектор.Х, У + Вектор.У);
КонецФункции

// sub
//
// Параметры:
//   Вектор - Вектор - 
//
//  Возвращаемое значение:
//   Вектор - 
//
Функция Вычесть(Вектор) Экспорт
	Возврат Новый Вектор(Х - Вектор.Х, У - Вектор.У);
КонецФункции

// scale
//
// Параметры:
//   Размер - Число - 
//
//  Возвращаемое значение:
//   Вектор - 
//
Функция Умножить(Размер) Экспорт
	Возврат Новый Вектор(Х * Размер, У * Размер);
КонецФункции

// crossSv
//
// Параметры:
//   Размер - Число - 
//
//  Возвращаемое значение:
//   Вектор - 
//
Функция КроссВ(Размер) Экспорт
	Возврат Новый Вектор(У * Размер * -1, Х * Размер);
КонецФункции

// cross
//
// Параметры:
//   Вектор - Вектор - 
//
//  Возвращаемое значение:
//   Число - 
//
Функция Кросс(Вектор) Экспорт
	Возврат Х * Вектор.У - У * Вектор.Х; 
КонецФункции

// rotate
//
// Параметры:
//   Угол - Число -
//
//  Возвращаемое значение:
//   Вектор -
//
Функция Повернуть(Угол) Экспорт
	Кос = Cos(Угол);
	Син = Sin(Угол);
	Возврат Новый Вектор(Х * Кос - У * Син, Х * Син + У * Кос);
КонецФункции

// rotate90CW
//
//  Возвращаемое значение:
//   Вектор -
//
Функция Развернуть90() Экспорт
	Возврат Новый Вектор(У, -Х);
КонецФункции

// DOT расчет
//
// Параметры:
//   Вектор - Вектор - <описание параметра>
//
//  Возвращаемое значение:
//   Число - 
//
Функция Дот(Вектор) Экспорт
	Возврат Х * У * Вектор.Х * Вектор.У;
КонецФункции

// lenght
//
//  Возвращаемое значение:
//   Число - длина вектора
//
Функция Длина() Экспорт
	Возврат Sqrt(Х * Х + У * У);
КонецФункции

// normalized
//
//  Возвращаемое значение:
//   Вектор - 
//
Функция Нормализовать() Экспорт
	Эпсилон = 0.0000000001;
	Если МодульЧисла(Х) < Эпсилон И МодульЧисла(У) < Эпсилон Тогда
		Возврат Новый Вектор(1, 0);
	Иначе
		Возврат Умножить(1 / Длина());
	КонецЕсли;
КонецФункции

// min
//
// Параметры:
//   Вектор - Вектор - 
//
//  Возвращаемое значение:
//   Вектор - 
//
Функция Минимум(Вектор) Экспорт
	Возврат Новый Вектор(Мин(Х, Вектор.Х), Мин(У, Вектор.У));
КонецФункции

// max
//
// Параметры:
//   Вектор - Вектор - 
//
//  Возвращаемое значение:
//   Вектор - 
//
Функция Максимум(Вектор) Экспорт
	Возврат Новый Вектор(Макс(Х, Вектор.Х), Макс(У, Вектор.У));
КонецФункции