
Перем Позиция Экспорт;
Перем Направление Экспорт;
Перем Угол Экспорт;
Перем УгловоеНаправление Экспорт;

Перем Ширина Экспорт;
Перем Высота Экспорт;
Перем Цвет Экспорт;

Процедура ПриСозданииОбъекта(Х, У)
	Позиция = Новый Вектор(Х, У);
	Направление = Новый Вектор(0, 0);
	Угол = 0;
	УгловоеНаправление = 0;
КонецПроцедуры

// Шаг обработки физики
//
// Параметры:
//   Размер - Число - 
//
Процедура Шаг(Размер) Экспорт
	Угол = Угол + УгловоеНаправление * Размер;
	Позиция = Позиция.Сложить(Направление.Умножить(Размер));
КонецПроцедуры