
// Физика
Перем Позиция Экспорт;
Перем Направление Экспорт;
Перем Угол Экспорт;
Перем УгловоеНаправление Экспорт;
Перем МоментЭнеррци Экспорт;
Перем Масса Экспорт;
Перем Статичный Экспорт;
Перем Трение Экспорт;
Перем Упругость Экспорт;

// Отображение
Перем Ширина Экспорт;
Перем Высота Экспорт;
Перем Цвет Экспорт;

Процедура ПриСозданииОбъекта(Х, У, СтатичныйОбъект = Ложь)
	Позиция = Новый Вектор(Х, У);
	Направление = Новый Вектор(0, 0);
	Статичный = СтатичныйОбъект;
	Угол = 0;
	УгловоеНаправление = 0;
	МоментЭнеррци = 1;
	Масса = 1;
	Трение = 0.6;
	Упругость = 0.05;
КонецПроцедуры

// step
//
// Параметры:
//   Дельта - Число - 
//
Процедура Шаг(Дельта) Экспорт

	Если Статичный Тогда
		Возврат;
	КонецЕсли;

	Угол = Угол + УгловоеНаправление * Дельта;
	Позиция = Позиция.Сложить(Направление.Умножить(Дельта));
КонецПроцедуры

// localToWorld - конвертирую локальну точку в мировую
//
// Параметры:
//   ЛокальнаяТочка - Вектор -
//
//  Возвращаемое значение:
//   Вектор - 
//
Функция ЛокальныйВМир(ЛокальнаяТочка) Экспорт
	Возврат Позиция.Сложить(ЛокальнаяТочка.Повернуть(Угол));
КонецФункции

// worldToLocal - конвертирую мировую точку в локальную
//
// Параметры:
//   МироваяТочка - Вектор -
//
//  Возвращаемое значение:
//   Вектор - 
//
Функция МирВЛокальный(МироваяТочка) Экспорт
	Возврат МироваяТочка.Вычесть(Позиция.Повернуть(-Угол));
КонецФункции

// applyImpulse
//
// Параметры:
//   Импульс - Вектор - <описание параметра>
//   ТочкаМира - Вектор - <описание параметра>
//
Процедура ПрименитьИмпульс(Импульс, ТочкаМира) Экспорт

	р = ТочкаМира.Вычесть(Позиция);

	УгловойИмпульс = р.Кросс(Импульс);

	Направление = Направление.Сложить(Импульс.Умножить(1 / Масса));
	УгловоеНаправление = УгловоеНаправление + УгловойИмпульс / МоментЭнеррци;
КонецПроцедуры

// containsPoint
//
// Параметры:
//   ТочкаМира - Вектор -
//
//  Возвращаемое значение:
//   Булево -
//
Функция ВключаетТочку(ТочкаМира) Экспорт

	ЛокальнаяТочка = МирВЛокальный(ТочкаМира);

	ВызватьИсключение "Не реализовано";

	Возврат Ложь;

КонецФункции

// getAABB
//
//  Возвращаемое значение:
//   ААББ - 
//
Функция ПолучитьААББ() Экспорт
	
	Бесконечность = 999999999;

	ААББ = Новый ААББ(Новый Вектор(Бесконечность, Бесконечность), Новый Вектор(-Бесконечность, -Бесконечность));

	ВызватьИсключение "Не реализовано";

	Возврат ААББ;

КонецФункции

// getAABB() {
// 	let aabb = new AABB(new Vec2(Infinity, Infinity), new Vec2(-Infinity, -Infinity));
// 	for (let shape of this.shapes) {
// 		if (shape instanceof CircleShape) {
// 			const worldCenter = this.localToWorld(shape.offset);
// 			aabb.expand([worldCenter.sub(new Vec2(shape.radius, shape.radius)), worldCenter.add(new Vec2(shape.radius, shape.radius))]);
// 		} else {
// 			shape.vertices.map(v => this.localToWorld(v)).forEach(v => aabb.expand([v]));
// 		}
// 	}
// 	return aabb;
// }