#Использовать "."

Перем Рейлиб Экспорт;
Перем Высота Экспорт;
Перем Ширина Экспорт;

// <Описание процедуры>
//
// Параметры:
//   Объекты - Массив из ФизическийОбъект - <описание параметра>
//
Процедура НаироватьОбъекты(Объекты)
	Для Каждого Кубик Из Объекты Цикл

		Координаты = Новый Массив;

		Для Каждого Вектор Из Кубик.Форма Цикл
			Позиция = Кубик.Позиция.Копировать();
			Позиция.У = Высота - Позиция.У;
			Точка = Вектор.Повернуть(Кубик.Угол).Сложить(Позиция);
			Координаты.Добавить(Рейлиб.НовыйВектор(Точка.Х, Точка.У));
		КонецЦикла;

		Рейлиб.НарисоватьТреугольникВеер(Координаты, Кубик.Цвет);
	КонецЦикла;
КонецПроцедуры

КаталогКомпоненты = ОбъединитьПути(ТекущийСценарий().Каталог, "../../src/raylibos/bin/Debug/net6.0/raylibos.dll");
ПодключитьВнешнююКомпоненту(КаталогКомпоненты);
Рейлиб = Новый Рейлиб;

ФПС = 60;
Шаг = ФПС / 400;

Ширина = 800;
Высота = 600;

Белый = Рейлиб.НовыйЦвет(255,255,255,255);

Рейлиб.УстановитьЧастотуКадров(ФПС);

Рейлиб.ИнициализацияОкна("Raylibos TexturePro Test", Ширина, Высота);

Физика = Новый Физика();

к = Новый ФизическийОбъект(200, 50);
к.Высота = 50;
к.Ширина = 50;
к.Цвет = Рейлиб.НовыйЦвет(10, 255, 10, 255);

Полстороны = 25;

к.Форма.Добавить(Новый Вектор(-Полстороны, -Полстороны));
к.Форма.Добавить(Новый Вектор(-Полстороны, Полстороны));
к.Форма.Добавить(Новый Вектор(Полстороны, Полстороны));
к.Форма.Добавить(Новый Вектор(Полстороны, -Полстороны));

к.Масса = 1;
к.МоментЭнеррци = 1;
к.ПрименитьИмпульс(Новый Вектор(20, 100), Новый Вектор(200.001, 50 - 0.01));

// Физика.Гравитация = Новый Вектор(0, -0.5);

Физика.Объекты.Добавить(к);

Пока НЕ Рейлиб.ОкноДолжноЗакрыться() Цикл

	Рейлиб.НачатьОтрисовку();
	Рейлиб.ОчиститьФон(Белый);

	Физика.Шаг(Шаг);

	НаироватьОбъекты(Физика.Объекты);

	Рейлиб.ПоказатьFPS(20, 15);

	Рейлиб.ЗакончитьОтрисовку();
	
КонецЦикла;

Рейлиб.ЗакрытьОкно();
