#Использовать "."

Перем Рейлиб Экспорт;
Перем Высота Экспорт;
Перем Ширина Экспорт;

Процедура НаироватьОбъекты(Объекты)
	Для Каждого Кубик Из Объекты Цикл
		Прямоугольник = Рейлиб.НовыйПрямоугольник(Кубик.Позиция.Х, Кубик.Позиция.У, Кубик.Ширина, Кубик.Высота);
		Рейлиб.НарисоватьПрямоугольникПро(Прямоугольник, Рейлиб.НовыйВектор(1, 1), Кубик.Угол, Кубик.Цвет);
	КонецЦикла;
КонецПроцедуры

КаталогКомпоненты = ОбъединитьПути(ТекущийСценарий().Каталог, "../../src/raylibos/bin/Debug/net6.0/raylibos.dll");
ПодключитьВнешнююКомпоненту(КаталогКомпоненты);
Рейлиб = Новый Рейлиб;

Ширина = 800;
Высота = 600;

Белый = Рейлиб.НовыйЦвет(255,255,255,255);

Рейлиб.УстановитьЧастотуКадров(60);

Рейлиб.ИнициализацияОкна("Raylibos TexturePro Test", Ширина, Высота);

Физика = Новый Физика();

к = Новый Кубик(300, 500);
к.Высота = 50;
к.Ширина = 50;
к.Цвет = Рейлиб.НовыйЦвет(10,255,10,255);

к.Направление = Новый Вектор(10, -90);
к.Угол = 3;
к.УгловоеНаправление = -10;

Физика.Объекты.Добавить(к);

Пока НЕ Рейлиб.ОкноДолжноЗакрыться() Цикл

	Рейлиб.НачатьОтрисовку();
	Рейлиб.ОчиститьФон(Белый);

	Физика.Шаг(0.07);

	НаироватьОбъекты(Физика.Объекты);

	Рейлиб.ПоказатьFPS(20, 15);

	Рейлиб.ЗакончитьОтрисовку();
	
КонецЦикла;

Рейлиб.ЗакрытьОкно();
