#Использовать "."

Перем Рейлиб Экспорт;
Перем Высота Экспорт;
Перем Ширина Экспорт;

Процедура НаироватьОбъекты(Объекты)
	Для Каждого Кубик Из Объекты Цикл
		Прямоугольник = Рейлиб.НовыйПрямоугольник(Кубик.Позиция.Х, Высота - Кубик.Позиция.У, Кубик.Ширина, Кубик.Высота);
		Рейлиб.НарисоватьПрямоугольникПро(Прямоугольник, Рейлиб.НовыйВектор(Кубик.Ширина/2, Кубик.Высота/2), Кубик.Угол, Кубик.Цвет);
	КонецЦикла;
КонецПроцедуры

КаталогКомпоненты = ОбъединитьПути(ТекущийСценарий().Каталог, "../../src/raylibos/bin/Debug/net6.0/raylibos.dll");
ПодключитьВнешнююКомпоненту(КаталогКомпоненты);
Рейлиб = Новый Рейлиб;

Ширина = 800;
Высота = 600;

Белый = Рейлиб.НовыйЦвет(255,255,255,255);

Рейлиб.УстановитьЧастотуКадров(60);

Рейлиб.ИнициализацияОкна("Raylibos TexturePro Test", Ширина, Высота);

Физика = Новый Физика();

к = Новый ФизическийОбъект(200, 200);
к.Высота = 50;
к.Ширина = 50;
к.Цвет = Рейлиб.НовыйЦвет(10, 255, 10, 255);

к.Масса = 0.7;
к.МоментЭнеррци = -200;
к.ПрименитьИмпульс(Новый Вектор(20, 55), Новый Вектор(300, 150));

// Физика.Гравитация = Новый Вектор(0, -0.5);

Физика.Объекты.Добавить(к);

Пока НЕ Рейлиб.ОкноДолжноЗакрыться() Цикл

	Рейлиб.НачатьОтрисовку();
	Рейлиб.ОчиститьФон(Белый);

	Физика.Шаг(0.15);

	НаироватьОбъекты(Физика.Объекты);

	Рейлиб.ПоказатьFPS(20, 15);

	Рейлиб.ЗакончитьОтрисовку();
	
КонецЦикла;

Рейлиб.ЗакрытьОкно();
